app/views/contratcdds/reporte.pdf.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <div class="societe">
    <% if @contratcdd.user.nomentreprise.present? %>

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <h4>
    <% if @contratcdd.employee.empcivilite.present? %>