app/views/contrats/reporte.pdf.erb

  <div class="societe">
    <% if @contrat.user.nomentreprise.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

              <h4>
                <% if @contrat.employee.empcivilite.present? %>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]