app/controllers/employees_controller.rb

INSERT INTO "employees" ("created_at", "updated_at", "empcivilite", "prenom", "nom", "adresse", "datedenaissance", "lieudenaissance", "nationalite", "nsecu", "permissejournum", "permissejourexp", "permissejourloc", "permissejourdate", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create

    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "permissejourexp" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["permissejourexp", "2018-10-10"], ["updated_at", "2017-10-10 12:44:42.873681"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)