app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."user_id" = $1  [["user_id", 1]]
---
  def index
    @invoices = current_user.invoices.all